Tekla Open API Reference for Tekla Structures 2025
Component.SetComponentInput Method
 Sets the component input object for the component. The component input object contains all the input objects and positions that are needed for the component creation.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetComponentInput(
	ComponentInput I
)
Public Function SetComponentInput (
	I As ComponentInput
) As Boolean
Parameters
I
Type: Tekla.Structures.Model.ComponentInput
The component input object.
Return Value
Type: Boolean
True if the input is received.
See Also
Reference
Component Class
Tekla.Structures.Model Namespace